{
  "backend/main.mo": "Motoko canister handling user profiles, question management, role-based authorization, and IQ test scoring logic with adaptive difficulty.",
  "feature_evidence.json": "Feature evidence report mapping PWA-related features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-like text listing short descriptions for all frontend components, pages, hooks, and assets.",
  "frontend/CHROME_INSTALL_AND_PUBLISH.md": "Guide describing how to install the PWA in Chrome, build it for production, and submit it to the Chrome Web Store.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens for light and dark themes and applying global styles.",
  "frontend/index.html": "App entry HTML containing PWA metadata, manifest link, and icon references for installability.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, start_url, theme colors, and 192x192 and 512x512 icons.",
  "frontend/public/sw.js": "Service worker implementing app‑shell caching, cache-first for static assets, and network-first for API calls with offline fallback.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, global layout, theme provider, and offline/profile modals.",
  "frontend/src/components/AppHeader.tsx": "Header with logo, navigation, and login/history controls based on authentication state.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button managing Internet Identity auth flow and clearing cached data.",
  "frontend/src/components/OfflineBanner.tsx": "Displays online/offline status banner with auto‑hide on reconnection.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new authenticated users to submit their name and save a profile.",
  "frontend/src/components/ProgressMeter.tsx": "Progress bar component showing current vs total steps as a percentage.",
  "frontend/src/components/RequireAuth.tsx": "Protects child content by requiring authentication, showing a sign‑in card otherwise.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for profiles, questions, answers, scoring, and counts.",
  "frontend/src/index.css": "Tailwind setup with light/dark CSS variables defining theme colors and base styles.",
  "frontend/src/main.tsx": "App entrypoint initializing React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/AttemptDetailsPage.tsx": "Displays a detailed view of a specific test attempt, showing summary stats and a breakdown of each answered question.",
  "frontend/src/pages/HistoryPage.tsx": "Shows the user's list of past test results with dates, scores, and navigation to individual attempt details.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with marketing content and a call-to-action to start the test, handling login if needed.",
  "frontend/src/pages/ResultsPage.tsx": "Displays the most recent completed test result with score, accuracy, timing, and offline status handling.",
  "frontend/src/pages/TestPage.tsx": "Runs the adaptive IQ test flow, loading questions, submitting answers, adjusting difficulty, and saving results.",
  "frontend/src/test/adaptiveLogic.ts": "Defines adaptive test configuration and functions to compute next difficulty and tolerance based on progress.",
  "frontend/src/test/historyStore.ts": "Manages storing, retrieving, and limiting test history in localStorage, including lookup by result ID.",
  "frontend/src/test/sessionTypes.ts": "Provides TypeScript interfaces for test sessions, attempts, and stored results used throughout the app.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL params, persisting them in sessionStorage, and cleaning hash parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, animations, container settings, and plugins.",
  "project_state.json": "Project metadata describing features, requirements, versions, and image needs for the High IQ app."
}